<!-- Please remove this file from your project -->
<template>
    <div id="main">
        <h1>О Нас</h1>
        <p>Наша команда  сложилась из инициативной группой инженеров с опытом работы как на различных производствах, ремонтных службах крупных предприятий, так и в конструкторских бюро, непосредственно участвующих в разработке технологий изготовления продукции машиностроения и САПР. Руководство компании, являясь опытными и дипломированными управленцами, так же является опытным техническими специалистами с большим опытом работы в качестве инженеров. \именно здесь Вы найдете единомышленников в реализации ваших проектов на производствах.В далёких 90-х годах мы в основном специализировались только на поставках промышленного оборудования по различным направлениям. Рынок развивался и диктовал новые требования к работе. В результаты из снабженческо-сбытовой наша компания выросла в инжиниринговую.

Сотрудники нашей компании — это технические специалисты c высшим образованием, постоянно повышающие свой профессиональный уровень.

Вы наши Заказчики, требовательные и грамотные, и мы делаем все, что бы соответствовать Вашим запросам.</p>
        <img src="about.jpg"/>
    </div>
</template>

<script>
export default {
    data() {
        return {
            
        };
    },
  computed: {
    
  },
  methods: {
    
  }
};
</script>

<style scoped>
button {
    text-align: center;
    align-content: center;
    width: 200px;
    padding: 1rem;
    margin: 1rem;
}

div { 
    text-align: center;
    flex-flow: row wrap;
}
</style>