<template>
    <div>
        <pre>
            Контактная информация:

Адрес: г. Тверь, ул. Красина, дом 46, к. 1, помещение 11( по ул. Румянцева)

Телефон в Твери: + 7 4822 633 007 доб. 102,103,104, 106, 107, 116; офис менеджер 100 




Адрес:  115432, г. Москва, Трофимова ул, дом № 24 корпус 2, помещение II (цоколь)
метро Кожуховская (5 мин пешком)

Телефон в Москве: +7 499 703 07 35 доб. 110,111; офис -менеджер доп. 100



Адрес: г. Ярославль, ул.Наумова, дом 67/2, офис 606

Телефон в Ярославле: +7 4852 695 096 доб 109 ;офис-менеджер доб. 100



Эл. почта prom@industry.link
Просим в теме писать кому адресуется тема и тема вопроса

Время работы: 
понедельник-четверг: с 9:00 до 18:00
пятница: с 9:00 до 17:30
суббота, воскресение: выходной
        </pre>
    </div>
</template>

<style scoped>
    pre {
        text-align: center;
        text-shadow: 10px;
        font-size: 18px;
    }
</style>