<!-- Please remove this file from your project -->
<template>
    <div id="main">
        <div v-if="aboutyes">
                <a href="/" class="overlay" id="b"></a>
                <div class="window">
                    <div id="alert">
                        <transition name="fade">
                            <p v-if="show"><pre>{{ message }}</pre></p>
                            <p v-else></p>
                        </transition>
                    </div>
                    <p>{{ item }}</p>
                    <div v-for="(img, key) in imgs">
                        <img v-if="key == item" id="ima" :src="img" />
                    </div>
                    <button v-on:click="addProduct(item)">Добавить в корзину</button>
                    <div>{{ value }}</div>
                    
                </div>
                <a class="close" title="Закрыть" href="/"></a>
        </div>
        <div id="shop">
            <div v-for="(value, item) in items">
                <div>
                    <div id="shop-item">
                        <div v-for="(img, key) in imgs">
                            <img v-if="key == item" id="img" :src="img" />
                        </div>
                        <label :tittle="item" :alt="item">{{ item }}</label>
                    </div>
                </div>
                <button v-on:click="getProduct(item, value)">Подробнее</button>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    data() {
        return {
            items: {
                "Contact module with 1 contact element (Контактныймодульс 1 контактным элементом)": `Описание продукта:	ПРИВОД-/ИНДИКАТОРНЫЙ КОМПОНЕНТ КОНТАКТНЫЙ БЛОК С 1 КОНТАКТНЫМ ЭЛЕМЕНТОМ ПОДПРУЖИНЕННЫЙ ТЕРМИНАЛ, 1NC!!! Поэтапный продукт!!! SIRIUS ACT 3SU1 является преемником Предпочтительного типа преемника >>3SU1400-1AA10-3CA0<<;
                                                                                                    \n\r Жизненный цикл продукта (PLM)	PM490: Начало заключительного года поддержки; 
                                                                                                    \n\r Данные о ценах: Региональная ценовая группа / Ценовая группа штаб-квартиры	41J / 41J; 
                                                                                                    \n\r Прайс-лист:	Цена по запросу; 
                                                                                                    \n\r Цена клиента: Доплата за сырье - Нет; 
                                                                                                    \n Металлический фактор:	LBO-----; 
                                                                                                    \n Правила экспортного контроля:	ECCN: N / AL: N;
                                                                                                    \n Стандартное время выполнения ex-works:	10 дней;
                                                                                                    \n Вес нетто (кг):	0,009 кг;
                                                                                                    \n Размер упаковки:	92,00 x 105,00 x 52,00;
                                                                                                    \n Размер упаковки единица измерения:	ММ;
                                                                                                    \n Единица измерения количества:	1 шт.;
                                                                                                    \n Количество упаковки:	1;
                                                                                                    \n Дополнительная информация о продукте:
                                                                                                    \n EAN	4011209449824;
                                                                                                    \n UPC	754554654669;
                                                                                                    \n Код товара	85365080;
                                                                                                    \n LKZ_FDB/ CatalogID:	CC-IC10;
                                                                                                    \n Группа продуктов:	5832;
                                                                                                    \n Код группы:	R711;
                                                                                                    \n Страна происхождения: Китай;
                                                                                                    \n Соответствие с ограничениями вещества согласно директиве RoHS:	Начиная с: 01.07.2006;
                                                                                                    \n Класс продукта	C: продукты, изготовленные / произведенные на заказ, которые не могут быть повторно использованы или повторно использованы или возвращены в кредит;
                                                                                                    \n Обязательство по возврату WEEE (2012/19 / EU):	ДА.`,

                "Актуатор поворотного пере-ключателя с подсветкой 22мм":    `Описание: Преимущества устройств SIRIUS ACT: Современный дизайн: 4 варианта исполнения устройств для различных условий, легкость при выборе и монтаже, онлайн-конфигуратор с возможностью формирования заказа. быстрый монтаж одной рукой. Экстремальная надежность: стандартное исполнение для всех устройств — степень защиты IP69K, гибкие возможности коммуникации, поддержка интерфейсов: AS-Interface, IO-Link и PROFINET;
                                                                            Класс: Аксессуары для переключателей;
                                                                            Страна: Китай;
                                                                            Производитель: Schneider Electric;
                                                                            Ед.измерения: шт;
                                                                            Сертификат: RU C-DE.АЖ26.B03233;
                                                                            Наименование в прайсе производителя: АКТУАТОР ПОВОРОТНОГО ПЕРЕКЛЮЧАТЕЛЯ С ВОЗМОЖНОСТЬЮ ПОДСВЕТКИ, 22MM, КРУГЛ., ГЛЯНЦЕВЫЙ МЕТАЛЛ, КОРОТКАЯ ЧЁРНАЯ РУКОЯТКА С БЕЛОЙ ВСТАВКОЙ, 2 КОММУТАЦИОННЫХ ПОЛОЖЕНИЯ: O-I, С ФИКСАЦИЕЙ, УГОЛ ПОВОРОТА РУКОЯТКИ 90 ГРАД. : 10:30Ч./13:30Ч;
                                                                            Тип изделия: Актуатор;
                                                                            Диаметр отверстия, мм: 22.3;
                                                                            Тип управляющего элемента: Тумблер;
                                                                            Конструкция линзы: Прямоугольная.`,

                "Комплектное устройство круг-лое индикатор с матовой линзой встроенный светодиод  24V UC красный с держателем ": `  Класс: Аксессуары для кнопочных постов и светосигнальной арматуры;
                                                                                                                                    Страна: Китай;
                                                                                                                                    Производитель: DEKraft;
                                                                                                                                    Ед.измерения: шт;
                                                                                                                                    Сертификат: RU C-DE.МЮ62.B00231;
                                                                                                                                    Диаметр отверстия, мм: 22;
                                                                                                                                    Степень защиты: IP66;
                                                                                                                                    Напряжение, В: 24.`,

                "Комплектное устройство круг-лое индикатор с матовой линзой встроенный светодиод 24V UC зеленый с держателем": `Класс: Кнопки;
                                                                                                                                Страна: Китай;
                                                                                                                                Производитель: IEK;
                                                                                                                                Ед.измерения: шт;
                                                                                                                                Сертификат: RU C-DE.МЮ62.B00231;
                                                                                                                                Наименование в прайсе производителя: КОМПЛЕКТНОЕ УСТРОЙСТВО КРУГЛОЕ КНОПКА С ПОДСВЕТКОЙ 1НO + ВСТРОЕННЫЙ СВЕТОДИОД 24V UC ЗЕЛЕНЫЙ С ДЕРЖАТЕЛЕМ (ПРЕДПОЧТИТЕЛЬНЫЙ ТИП);
                                                                                                                                Тип изделия: Кнопка;
                                                                                                                                Способ монтажа: На лицевую панель;
                                                                                                                                Цвет толкателя: Зеленый;
                                                                                                                                Наличие индикатора (сигнальной лампы): Да;
                                                                                                                                Количество НО контактов: 1;
                                                                                                                                Степень защиты: IP66;
                                                                                                                                Диаметр отверстия, мм: 22;
                                                                                                                                Диапазон рабочих температур: от -25 до +70;
                                                                                                                                Форма: Круглая;
                                                                                                                                Материал изделия: Пластик.`,

                "Комплектное устройство круг-лое индикатор с матовой линзой встроенный светодиод 24V UC желтый с держателем": ` Класс: Светосигнальная арматура;
                                                                                                                                Страна: Китай;
                                                                                                                                Производитель: IEK;
                                                                                                                                Ед.измерения: шт;
                                                                                                                                Сертификат: RU C-DE.АЖ26.B03233;
                                                                                                                                Наименование в прайсе производителя: КОМПЛЕКТНОЕ УСТРОЙСТВО КРУГЛОЕ ИНДИКАТОР С МАТОВОЙ ЛИНЗОЙ ВСТРОЕННЫЙ СВЕТОДИОД 24V UC ЖЕЛТЫЙ С ДЕРЖАТЕЛЕМ;
                                                                                                                                Тип изделия: Индикатор;
                                                                                                                                Напряжение, В: 24;
                                                                                                                                Диаметр отверстия, мм: 22;
                                                                                                                                Степень защиты: IP66.`,

                "Контактор вспомогательный 3НО+1НЗ AC 24V  или аналоги": `   Класс: Пускатели и контакторы магнитные;
                                                                            Страна: Китай;
                                                                            Производитель: IEK;
                                                                            Ед.измерения: шт;
                                                                            Сертификат: RU C-DE.АЖ26.B03233;
                                                                            Наименование в прайсе производителя: КОНТАКТОР, AC-3, 3КВТ/400В, 2НО+2НЗ, НОМ. НАПРЯЖЕНИЕ УПРАВЛЕНИЯ 24В DC, С ДИОДОМ, 3-ПОЛ., ТИПОРАЗМЕР S00, ВИНТОВЫЕ ЗАЖИМЫ, ВСТРОЕННЫЙ БЛОК-КОНТАКТ ДЛЯ ПРИМЕНЕНИЙ SUVA;
                                                                            Тип изделия: Контактор;
                                                                            Номинальный ток,А: 7;
                                                                            Напряжение катушки управления, В: 24;
                                                                            Род тока катушки управления: Постоянный (DC);
                                                                            Напряжение, В: 690;
                                                                            Род тока: Переменный (AC);
                                                                            Количество силовых НО контактов: 3;
                                                                            Количество силовых НЗ контактов: 0;
                                                                            Количество НО контактов: 2;
                                                                            Количество НЗ контактов: 2;
                                                                            Исполнение: Нереверсивное;
                                                                            Способ монтажа: DIN-рейка/Монтажная плата;
                                                                            Степень защиты: IP20;
                                                                            Номинальная мощность электродвигателя, КВт: 3;
                                                                            Количество силовых полюсов: 3;
                                                                            Высота, мм: 58;
                                                                            Нормативный документ: ТР ТС 004/2011, ТР ТС 020/2011;
                                                                            Масса, кг: 0.348;
                                                                            Климатическое исполнение: УХЛ3;
                                                                            Тип подключения: Зажимное, пружинное;
                                                                            Глубина, мм: 117;
                                                                            Ширина, мм: 45;
                                                                            Максимальное сечение подключаемого кабеля, мм2: 4;
                                                                            Сфера применения: Промышленность.`,

                "Контактор вспомогательный 4НО катушка управления 24В DC  или аналог": `Класс: Пускатели и контакторы магнитные;
                                                                                        Страна: Китай;
                                                                                        Производитель: IEK;
                                                                                        Ед.измерения: шт;
                                                                                        Сертификат: RU C-DE.АЖ26.B03233;
                                                                                        Наименование в прайсе производителя: COUPLING CONTACTOR RELAY, 4NO DC 24V, 0.7...1.25*US, SZ S00, SPRING-LOADED TERMINAL;
                                                                                        Тип изделия: Контактор вспомогательный;
                                                                                        Номинальный ток,А: 10;
                                                                                        Напряжение катушки управления, В: 24;
                                                                                        Род тока катушки управления: Постоянный (DC);
                                                                                        Напряжение, В: 380;
                                                                                        Количество НО контактов: 4;
                                                                                        Исполнение: Нереверсивное;
                                                                                        Способ монтажа: DIN-рейка/Монтажная плата;
                                                                                        Степень защиты: IP20;
                                                                                        Количество силовых полюсов: 4;
                                                                                        Цвет: Серый;
                                                                                        Тип подключения: Зажимное, пружинное;
                                                                                        Номинальное напряжение, В: 400.`,

                "Контактор вспомогательный 3НО+1НЗ AC 24V  или аналог": `   Класс: Пускатели и контакторы магнитные;
                                                                            Страна: Китай;
                                                                            Производитель: IEK;
                                                                            Ед.измерения: шт;
                                                                            Наименование в прайсе производителя: ВСПОМОГАТЕЛЬНЫЙ КОНТАКТОР, 3НO+1НЗ, НОМИНАЛЬНОЕ ПИТАЮЩЕЕ НАПРЯЖЕНИЕ ЦЕПИ УПРАВЛЕНИЯ US AC 230 V, 50 ГЦ, ВИНТОВЫЕ КЛЕММЫ, ТИПОРАЗМЕР S00;
                                                                            Род тока: Переменный (AC);
                                                                            Количество НО контактов: 3;
                                                                            Количество НЗ контактов: 1;
                                                                            Степень защиты: IP20;
                                                                            Масса, кг: 0.199;
                                                                            Высота, мм: 57.5;
                                                                            Диапазон рабочих температур: от -25 до +60;
                                                                            Глубина, мм: 72;
                                                                            Ширина, мм: 45;
                                                                            Степень загрязнения: 3.`,

                "МОДУЛЬ БЛОК-КОНТАКТОВ, 2НО+2НЗ: 1НО, 1НЗ, 1НЗ, 1НО, Д. ВСПОМ. КОНТАКТОРОВ И КОНТАКТОРОВ ДЛЯ КОМ-МУТАЦИИ ЭЛЕКТРОДВИГА-ТЕЛЕЙ, ТИПОРАЗМЕР S00-S2, ВИНТОВЫЕ КЛЕММЫ": ` Класс: Вспомогательные элементы и аксессуары к пускателям и контакторам;
                                                                                                                                                                                    Страна: Китай;
                                                                                                                                                                                    Производитель: IEK;
                                                                                                                                                                                    Ед.измерения: шт;
                                                                                                                                                                                    Сертификат: RU C-DE.АЖ26.B03233;
                                                                                                                                                                                    Наименование в прайсе производителя: AUX. SWITCH BLOCK , 2NO+2NC COND. PATHS: 1NC, 1NC, 1NO, 1NO, F. CONT. RELAYS A. MOTOR CONT. SZ S00 AND S0, SCREW TERMINAL DIN EN 50012 AND DIN EN 50005;
                                                                                                                                                                                    Тип изделия: Блок вспомогательных контактов;
                                                                                                                                                                                    Количество НЗ контактов: 2;
                                                                                                                                                                                    Количество НО контактов: 2;
                                                                                                                                                                                    Количество переключающих контактов: 0;
                                                                                                                                                                                    Масса, кг: 0.052;
                                                                                                                                                                                    Высота, мм: 37.5;
                                                                                                                                                                                    Степень защиты: IP20;
                                                                                                                                                                                    Диапазон рабочих температур: от -25 до +60;
                                                                                                                                                                                    Способ монтажа: На аппарат;
                                                                                                                                                                                    Глубина, мм: 43.7;
                                                                                                                                                                                    Ширина, мм: 36.`,

                "Реле времени": `Класс: Реле времени;
                                Страна: Китай;
                                Производитель: IEK;
                                Ед.измерения: шт;
                                Сертификат: RU C-DE.АЖ26.B03233;
                                Наименование в прайсе производителя: ЭЛЕКТРОННОЕ РЕЛЕ ВРЕМЕНИ МУЛЬТИФУНКЦИОНАЛЬНОЕ, 16 ФУНКЦИЙ 2 ПЕР. КОНТАКТЫ AC/DC 24 ДО 240V 0, 05S ДО 100H ШИРИНА УСТАНОВКИ 45MM ВИНТОВЫЕ ЗАЖИМЫ;
                                Тип изделия: Реле времени;
                                Высота, мм: 57;
                                Номинальное напряжение управления, В: 240;
                                Глубина, мм: 73;
                                Ширина, мм: 45;`,

                "Клемма 4мм.кв 6.2мм серая": `  Класс: Клеммы на DIN-рейку;
                                            Страна: Россия;
                                            Производитель: DKC;
                                            Ед.измерения: шт;
                                            Упаковки: 50 шт;
                                            Сертификат: RU C-DE.АЖ26.B03233;
                                            Наименование в прайсе производителя: КЛЕММА 4ММ2, 6,2MM, СЕРЫЙ;
                                            Тип изделия: Клемма;
                                            Диапазон сечений: 0.14-4;
                                            Цвет: Бежевый;
                                            Длина, мм: 47.7;
                                            Номинальный ток,А: 30;
                                            Способ монтажа: DIN-рейка;
                                            Диапазон рабочих температур: от -25 до +55;
                                            Напряжение, В: 1000;
                                            Материал изделия: Термопласт.`,

                "Клемма 4мм.кв 6.2мм синяя": `  Класс: Клеммы на DIN-рейку;
                                            Страна: Россия;
                                            Производитель: DKC;
                                            Ед.измерения: шт;
                                            Упаковки: 50 шт;
                                            Сертификат: RU C-DE.АЖ26.B03233;
                                            Наименование в прайсе производителя: КЛЕММА 4ММ2, 6,2MM, СИНИЙ;
                                            Тип изделия: Клемма;
                                            Диапазон сечений: 0.14-4;
                                            Цвет: Бежевый;
                                            Длина, мм: 47.7;
                                            Номинальный ток,А: 30;
                                            Способ монтажа: DIN-рейка;
                                            Диапазон рабочих температур: от -25 до +55;
                                            Напряжение, В: 1000;
                                            Материал изделия: Термопласт.`,

                "Клемма 4мм.кв 6.2мм Ж/З –желто-зеленая": ` Класс: Клеммы на DIN-рейку;
                                                            Страна: Китай;
                                                            Производитель: IEK;
                                                            Ед.измерения: шт;
                                                            Упаковки: 20 шт, 1120 шт, 47040 шт;
                                                            Сертификат: RU C-CN.СП28.B00915-20;
                                                            Наименование в прайсе производителя: Зажим наборный ЗНИ-4PEN 4мм2 (JXB-земля) ИЭК;
                                                            Тип изделия: Клемма;
                                                            Количество контактов: 2;
                                                            Диапазон сечений: 0.2-4;
                                                            Цвет: Желтый/Зеленый;
                                                            Номинальный ток,А: 35;
                                                            Способ монтажа: DIN-рейка;
                                                            Материал изделия: Металл, пластик;
                                                            Степень защиты: IP20;
                                                            Высота, мм: 43;
                                                            Длина, мм: 41;
                                                            Климатическое исполнение: УХЛ3;
                                                            Тип изделия: Принадлежности для распределительных шкафов;
                                                            Диапазон рабочих температур: от -40 до +80;
                                                            Напряжение, В: 220;
                                                            Глубина, мм: 7;
                                                            Ширина, мм: 58.`,

                "Coverterminal  или аналог": `D2SW TERMINAL COVER Водонепроницаемый Миниатюрный Переключатель защелкивающегося действия • Высококачественный водонепроницаемый миниатюрный переключатель защелкивающегося действия. Корпус выключателя соответствует требованиям стандарта IP67 (IEC 529) • Моноблочная конструкция обеспечивает высокую герметичность и идеально подходит для пыльных мест или мест, где распыляется вода.• Широкий диапазон рабочих температур от -40 ° C до 85 ° C • Идеально подходит для автомобилей, сельскохозяйственной техники, автоматических торговых автоматов, холодильников, производства льда, горячего водоснабжения, кондиционеров и промышленного оборудования, которое требует высокой устойчивости к воздействию окружающей среды • Соответствует требованиям RoHS`,
                "Through-type terminals (gray, 5.2mm)  илианалог": `Класс: Клеммы на DIN-рейку;
                                                                    Страна: Китай;
                                                                    Производитель: IEK;
                                                                    Ед.измерения: шт;
                                                                    Упаковки: 50 шт;
                                                                    Цвет: Серый;
                                                                    Длина, мм: 48.5;
                                                                    Номинальный ток,А: 30;
                                                                    Диапазон рабочих температур: от -25 до +55;
                                                                    Напряжение, В: 690;
                                                                    Материал изделия: Термопласт;
                                                                    Номинальное напряжение, В: 800;
                                                                    Класс негорючести изоляционного материала по UL94: V0.`,

                "Jumperplug (5 divisions) или аналог": `Класс: Аксессуары для клемм;
                                                        Страна: Китай;
                                                        Производитель: IEK;
                                                        Ед.измерения: шт;
                                                        Упаковки: 50 шт;
                                                        Сертификат: RU C-DE.АД07.B00806-19;
                                                        Наименование в прайсе производителя: МОСТ ДЛЯ КЛЕММЫ 5.2ММ 2-ПОЛ;
                                                        Тип изделия: Соединитель;
                                                        Номинальный ток,А: 24.`,

                "Таблички длинные 1 - 10, раз-мер ZB5": `   Класс: Аксессуары для клемм;
                                                            Страна: Китай;
                                                            Производитель: IEK;
                                                            Ед.измерения: шт;
                                                            Упаковки: 100 шт;
                                                            Сертификат: RU C-DE.АЖ26.B03233;
                                                            Наименование в прайсе производителя: ТАБЛИЧКИ ДЛИННЫЕ 1 - 10 РАЗМЕР ZB5;
                                                            Тип изделия: Табличка маркировочная.`,

                "Таблички длинные 11 - 20, раз-мер ZB5": `   Класс: Аксессуары для клемм;
                                                            Страна: Китай;
                                                            Производитель: IEK;
                                                            Ед.измерения: шт;
                                                            Упаковки: 100 шт;
                                                            Сертификат: RU C-DE.АЖ26.B03233;
                                                            Наименование в прайсе производителя: ТАБЛИЧКИ ДЛИННЫЕ 11 - 20 РАЗМЕР ZB5;
                                                            Тип изделия: Табличка маркировочная.`,

                "Таблички длинные 1 - 10, раз-мер ZB6": `   Класс: Аксессуары для клемм;
                                                            Страна: Китай;
                                                            Производитель: IEK;
                                                            Ед.измерения: шт;
                                                            Упаковки: 100 шт;
                                                            Сертификат: RU C-DE.АЖ26.B03233;
                                                            Наименование в прайсе производителя: ТАБЛИЧКИ ДЛИННЫЕ 1 - 10 РАЗМЕР ZB6;
                                                            Тип изделия: Табличка маркировочная.`,
                "Блок питания 24 V/4 A": `  EDR – серия источников питания на DIN-рейку в узком корпусе для бюджетного применения.
                                            Преобразователи могут применяться в устройствах управления производственными процессами, автоматизации, электромеханических системах.
                                            • Подстройка выходного напряжения до +16%;
                                            • Диапазон входного напряжения: 90…264 В АС / 127…370 В DC;
                                            • Диапазон рабочей температуры: -20…+60ºС;
                                            • Электрическая прочность изоляции вход-выход: 3000 В AC;
                                            • Защита от короткого замыкания, перегрузки, перенапряжения, перегрева;
                                            • Электромагнитная совместимость: EN55022 класс А.
                                            Выходное напряжение, В:	24;
                                            Выходной ток, А:	5;
                                            Мощность, Вт:	120;
                                            Размеры, мм:	40x125.2x113.5;
                                            Серия:	edr-120;
                                            Вес, г:	650.`
            },
    imgs: { "Contact module with 1 contact element (Контактныймодульс 1 контактным элементом)": "1.webp",
            "Актуатор поворотного пере-ключателя с подсветкой 22мм": "2.jpg",
            "Комплектное устройство круг-лое индикатор с матовой линзой встроенный светодиод  24V UC красный с держателем ": "3.jpg",
            "Комплектное устройство круг-лое индикатор с матовой линзой встроенный светодиод 24V UC зеленый с держателем": "4.jpg",
            "Комплектное устройство круг-лое индикатор с матовой линзой встроенный светодиод 24V UC желтый с держателем": "5.jpg",
            "Контактор вспомогательный 3НО+1НЗ AC 24V  или аналоги": "6.png",
            "Контактор вспомогательный 4НО катушка управления 24В DC  или аналог": "7.jpg",
            "Контактор вспомогательный 3НО+1НЗ AC 24V  или аналог": "8.jpg",
            "МОДУЛЬ БЛОК-КОНТАКТОВ, 2НО+2НЗ: 1НО, 1НЗ, 1НЗ, 1НО, Д. ВСПОМ. КОНТАКТОРОВ И КОНТАКТОРОВ ДЛЯ КОМ-МУТАЦИИ ЭЛЕКТРОДВИГА-ТЕЛЕЙ, ТИПОРАЗМЕР S00-S2, ВИНТОВЫЕ КЛЕММЫ": "9.jpg",
            "Реле времени": "10.jpg",
            "Клемма 4мм.кв 6.2мм серая": "11.jpg",
            "Клемма 4мм.кв 6.2мм синяя": "12.jpg",
            "Клемма 4мм.кв 6.2мм Ж/З –желто-зеленая": "13.jpg",
            "Coverterminal  или аналог": "14.jpg",
            "Through-type terminals (gray, 5.2mm)  или аналог": "15.png",
            "Jumperplug (5 divisions) или аналог": "16.jpg",
            "Таблички длинные 1 - 10, раз-мер ZB5": "17.jpg",
            "Таблички длинные 11 - 20, раз-мер ZB5": "18.jpg",
            "Таблички длинные 1 - 10, раз-мер ZB6": "19.jpg",
            "Блок питания 24 V/4 A": "20.jpg"
            },
    show: false,
    cart: [],
    message: "",
    aboutyes: false
    };
  },
  computed: {
    Checker() {
        
        
    }
  },
  methods: {
    async addProduct(item) {
      this.cart += item
      this.show = true;
      this.message = `Добавлен в корзину товар ${item} \n `
      setTimeout(function(){ 
            if (this.show) {
                this.show = false
                this.message = ""
            }
        },1000);
    },
    async getProduct(item, value) {
        this.aboutyes = true
        this.item = item
        this.value = value
        document.location.href= await "/#b"
    }
  }
};
</script>

<style scoped>
#shop {
    align-content: center;
    display: flex;
    overflow: hidden
}
#shop-item {
    width: 200px;
    height: 200px;
    box-sizing: border-box;
        flex: 1 0 250px;
        margin: 1rem;
        padding: 1rem;
        border: 1px solid #000;
        border-radius: 5px;
    overflow: hidden;
}
button {
    text-align: center;
    align-content: center;
    width: 200px;
    padding: 1rem;
    margin: 1rem;
}
#img {
    width:170px;
    height:100px;
}
#ima {
    width:300px;
    height:300px;
}
div { 
    flex-flow: row wrap;
}

.fade-enter-active, .fade-leave-active {
  transition: opacity .5s;
}
.fade-enter, .fade-leave-to /* .fade-leave-active до версии 2.1.8 */ {
  opacity: 0;
}
#alert {
    text-align: center;
}

/*Затемнение дисплея*/
.overlay {
    background-color: rgba(1, 0, 0, 0.77);
    right: 0;
    left: 0;
    position: fixed; 
    top: 0;
    bottom: 0;
    z-index: 11;
    display: none;
}
/*Слой становится видимым*/
.overlay:target {
    display: block;
}
/*Растягиваю картинку на всю ширину попапа*/
.window img { 
   width: 100%;
}
/*Характеристики самого окна, которое появляется после клика на кнопке*/
.window {
    display: flex;
    left: 50%;
    z-index: 12;
    margin: 0;
    position: fixed;
    padding: 15px;
    border: 1px solid #383738;
    background: #fefeff;
    border-radius: 15px;
    box-shadow: 0 13px 21px rgba(0,1,0,.19),0 21px 63px rgba(0,1,0,.31);
    transform: translate(-50%, -450%);
    transition: transform 0.6s ease-out;
    overflow: scroll;
    white-space: wrap;
}
/*Появление модального окошка с верхнего края экрана*/
.overlay:target+.window {
    transform: translate(-50%, 0);
    top: 1%;
}
/*Внешний вид кнопки «Закрыть»*/
.close {
    top: -11px;
    right: -11px;
    width: 23px;
    height: 23px;
    position: absolute;
    padding: 0;
    border: 2px solid #ccd;
    border-radius: 15px;
    background-color: rgba(61, 61, 61, 0.81);
    box-shadow: 0 0 12px #010;
    text-align: center;
    text-decoration: none;
    font: 18px sans-serif;
    font-weight: bold;
    transition: all ease .9s;
}
.close:before {
    color: rgba(254, 254, 254, 0.89);
    content: "X";
    text-shadow: 0 1px 3px #010;
    font-size: 14px;
}
/*Изменение характеристик при наведении на область */
.close:hover {
    background-color: rgba(253, 21, 0, 0.83);
    transform: rotate(360deg);    
}
/*Оформление главной кнопки*/
#button-lay {
  margin-left: 40%;
font-size: 33px;
  border-radius: 11px;
    background-color: rgba(63, 63, 63, 0.9);
    box-shadow: 0 3px 10px #010;
    text-align: center;
    text-decoration: none;
   background: #DCDCDC; 
    padding: 6px 17px; 
}
</style>